app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-09-21 23:45:56.390704"], ["status", "public"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)